SQL stands for “Structured Query Language” and can be pronounced as “SQL” or “sequel – (Structured English Query Language)”. It is used to query, modify, and transform data in a relational database. Database consists of one or more data tables. A query is an inquiry or request about data from a database.

Every app uses database that helps store data and provides functionality like modifying and querying the data. Databases can be in many forms like Spatial, non-relational, graph , relational. Most popular amongst them is a Relational database.

SQL is used to query a structured data i.e. data in the tabular form. Columns in the table are referred to as fields and rows as a record.

A relational database is a type of database that stores and provides access to the values that are related to one another.

The columns of the table hold attributes/properties of the data, and each row usually has a value for each attribute, making it easy to establish the relationships among them.

 A relational database represents a collection of related (two-dimensional) tables. Each of the tables are similar to an Excel spreadsheet, with a fixed number of named columns (the attributes or properties of the table) and any number of rows of data.

In [1]:
import pandas as pd
df1 = pd.DataFrame({'id':[1,2], 'employee_name': [ 'Rahul', 'Radhika'], 'location':['Mumbai', 'Pune']})
df1.set_index('id', inplace = True)
df1

   employee_name location
id
1          Rahul   Mumbai
2        Radhika     Pune

In [2]:
df2 = pd.DataFrame({'id':[1,2], 'profession': [ 'Engineer', 'Statistician'], 'salary':[60000, 80000]})
df2.set_index('id', inplace = True)
df2

      profession  salary
id
1       Engineer   60000
2   Statistician   80000

In [3]:
df3 = pd.DataFrame({'employee_id':[1,1,2], 'expertise': [ 'Python', 'Mathematics', 'Statistics']})
df3.set_index('employee_id', inplace = True)
df3

               expertise
employee_id
1                 Python
1            Mathematics
2             Statistics

Suppose one has to find out the profession, salary and expertise of the person with employee_id 2, the information about which is available in three different tables.
It becomes easy with relational database as all the tables have one column 'Id' as a connecting link.
Otherwise one has to create one more table as given below.

In [4]:
df = pd.DataFrame({'employee_id':[1,1,2],'profession': ['Engineer','Engineer', 'Statistician'], 'salary':[60000,60000, 80000], 'expertise': [ 'Python', 'Mathematics', 'Statistics'],'employee_name': ['Rahul', 'Rahul', 'Radhika'], 'location':['Mumbai','Mumbai', 'Pune']})
df.set_index('employee_id', inplace = True)
df

               profession  salary    expertise employee_name location
employee_id
1                Engineer   60000       Python         Rahul   Mumbai
1                Engineer   60000  Mathematics         Rahul   Mumbai
2            Statistician   80000   Statistics       Radhika     Pune

Comment in SQL is either preceded by two hyphens or can be written within /* ... */ as shown below : 

-- comment goes here

/* comment goes here */

How to install mysql link - 
https://www.mysql.com/downloads/